<center>
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/Logos/organization_logo/organization_logo.png" width="300" alt="cognitiveclass.ai logo"  />
</center>

# Working with a real world data-set using SQL and Python

Estaimted time needed: **30** minutes

## Objectives

After complting this lab you will be able to:

*   Understand the dataset for Chicago Public School level performance
*   Store the dataset in an Db2 database on IBM Cloud instance
*   Retrieve metadata about tables and columns and query data from mixed case columns
*   Solve example problems to practice your SQL skills including using built-in database functions

## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: [https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: [https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true](https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&download=true&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

**NOTE**:

Do not download the dataset directly from City of Chicago portal. Instead download a static copy which is a more database friendly version from this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">link</a>.

Now review some of its contents.

### Store the dataset in a Table

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. To analyze the data using SQL, it first needs to be stored in the database.

While it is easier to read the dataset into a Pandas dataframe and then PERSIST it into the database as we saw in the previous lab, it results in mapping to default datatypes which may not be optimal for SQL querying. For example a long textual field may map to a CLOB instead of a VARCHAR.

Therefore, **it is highly recommended to manually load the table using the database console LOAD tool, as indicated in Week 2 Lab 1 Part II**. The only difference with that lab is that in Step 5 of the instructions you will need to click on create "(+) New Table" and specify the name of the table you want to create and then click "Next".

##### Now open the Db2 console, open the LOAD tool, Select / Drag the .CSV file for the CHICAGO PUBLIC SCHOOLS dataset and load the dataset into a new table called **SCHOOLS**.

<a href="https://cognitiveclass.ai/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"><img src = "https://ibm.box.com/shared/static/uc4xjh1uxcc78ks1i18v668simioz4es.jpg"></a>

### Connect to the database

Let us now load the ipython-sql  extension and establish a connection with the database

The following modules are pre-installed in the Skills Network Labs environment. However if you run this notebook commands in a different Jupyter environment (e.g. Watson Studio or Ananconda) you may need to install these libraries by removing the `#` sign before `!pip` in the code cell below.

In [2]:
# These libraries are pre-installed in SN Labs. If running in another environment please uncomment lines below to install them:
#!pip install --force-reinstall ibm_db==3.1.0 ibm_db_sa==0.3.3
# Ensure we don't load_ext with sqlalchemy>=1.4 (incompadible)
#!pip uninstall sqlalchemy==1.4 -y && pip install sqlalchemy==1.3.24
#!pip install ipython-sql

Collecting ibm_db==3.1.0
  Using cached ibm_db-3.1.0-py3-none-any.whl
Collecting ibm_db_sa==0.3.3
  Using cached ibm_db_sa-0.3.3-py3-none-any.whl
Collecting sqlalchemy>=0.7.3
  Using cached SQLAlchemy-1.4.31-cp39-cp39-win_amd64.whl (1.6 MB)
Collecting greenlet!=0.4.17
  Using cached greenlet-1.1.2-cp39-cp39-win_amd64.whl (101 kB)
Installing collected packages: greenlet, sqlalchemy, ibm-db-sa, ibm-db
  Attempting uninstall: greenlet
    Found existing installation: greenlet 1.1.2
    Uninstalling greenlet-1.1.2:
      Successfully uninstalled greenlet-1.1.2
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.3.24
    Uninstalling SQLAlchemy-1.3.24:
      Successfully uninstalled SQLAlchemy-1.3.24

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ProtocolError('Connection aborted.', ConnectionResetError(10054, 'Se ha forzado la interrupción de una conexión existente por el host remoto', None, 10054, None))': /simple/ibm-db/
ERROR: Could not install packages due to an OSError: [WinError 5] Acceso denegado: 'C:\\Users\\Adolfo Ayuso Hdz\\anaconda3\\Lib\\site-packages\\~qlalchemy\\cprocessors.cp39-win_amd64.pyd'
Consider using the `--user` option or check the permissions.

Found existing installation: SQLAlchemy 1.4.31
Uninstalling SQLAlchemy-1.4.31:
  Successfully uninstalled SQLAlchemy-1.4.31
Collecting sqlalchemy==1.3.24
  Using cached SQLAlchemy-1.3.24-cp39-cp39-win_amd64.whl (1.2 MB)
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.24

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ProtocolError('Connection aborted.', ConnectionResetError(10054, 'Se ha forzado la interrupción de una conexión existente por el host remoto', None, 10054, None))': /simple/sqlalchemy/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ProtocolError('Connection aborted.', ConnectionResetError(10054, 'Se ha forzado la interrupción de una conexión existente por el host remoto', None, 10054, None))': /simple/sqlalchemy/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'ProtocolError('Connection aborted.', ConnectionResetError(10054, 'Se ha forzado la interrupción de una conexión existente por el host remoto', None, 10054, None))': /simple/sqlalchemy/

Requirement already satisfied: ipython-sql in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython>=1.0 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython-sql) (7.29.0)
Requirement already satisfied: sqlparse in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython-sql) (1.3.24)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: prettytable<1 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: colorama in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: setuptools>=18.5 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (58.0.4)
Requirement already satisfied: pygments in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.10.0)
Requirement already satisfied: backcall in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=4.2 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: pickleshare in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.20)
Requirement already satisfied: decorator in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.0)
Requirement already satisfied: jedi>=0.16 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.0)
Requirement already satisfied: matplotlib-inline in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.2)
Requirement already satisfied: wcwidth in c:\users\adolfo ayuso hdz\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)

In [1]:
%load_ext sql

In [6]:
# Enter the connection string for your Db2 on Cloud database instance below
# %sql ibm_db_sa://my-username:my-password@my-hostname:my-port/my-db-name?security=SSL
#%sql ibm_db_sa://jgy33112:1HrwTRIe4NGOG5zc@2f3279a5-73d1-4859-88f0-a6c3e6b4b907.c3n41cmd0nqnrk39u98g.databases.appdomain.cloud:30756/BLUDB?security=SSL
%sql mssql+pyodbc://sa:AdolfoAyuso1$@sqlsodbc

### Query the database system catalog to retrieve table metadata

##### You can verify that the table creation was successful by retrieving the list of all tables in your schema and checking whether the SCHOOLS table was created

In [18]:
# type in your query to retrieve list of all tables in the database for your db2 schema (username)
%sql Select name from sysobjects where xtype='U'

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[('TEST', 901578250, 'U ', 1, 0, 0, 0, 0, 0, datetime.datetime(2022, 2, 14, 20, 43, 40, 383000), 0, 0, 0, 'U ', 1, 3, 0, datetime.datetime(2022, 2, 14, 20, 43, 40, 383000), 0, 0, 0, 0, 0, 0, 0),
 ('ChicagoPublicSchools', 933578364, 'U ', 1, 0, 0, 0, 0, 0, datetime.datetime(2022, 2, 14, 20, 54, 47, 190000), 0, 0, 0, 'U ', 1, 3, 0, datetime.datetime(2022, 2, 14, 20, 54, 47, 190000), 0, 0, 0, 0, 0, 0, 0)]

Double-click **here** for a hint

<!--
In Db2 the system catalog table called SYSCAT.TABLES contains the table metadata
-->

Double-click **here** for the solution.

<!-- Solution:

%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES where TABSCHEMA='YOUR-DB2-USERNAME'

or, you can retrieve list of all tables where the schema name is not one of the system created ones:

%sql select TABSCHEMA, TABNAME, CREATE_TIME from SYSCAT.TABLES \
      where TABSCHEMA not in ('SYSIBM', 'SYSCAT', 'SYSSTAT', 'SYSIBMADM', 'SYSTOOLS', 'SYSPUBLIC')
      
or, just query for a specifc table that you want to verify exists in the database
%sql select * from SYSCAT.TABLES where TABNAME = 'SCHOOLS'

-->

### Query the database system catalog to retrieve column metadata

##### The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [19]:
# type in your query to retrieve the number of columns in the SCHOOLS table
%sql Select count(*) from information_schema.columns where upper(table_name)='CHICAGOPUBLICSCHOOLS'

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(78,)]

Double-click **here** for a hint

<!--
In Db2 the system catalog table called SYSCAT.COLUMNS contains the column metadata
-->

Double-click **here** for the solution.

<!-- Solution:

%sql select count(*) from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'

-->

Now retrieve the the list of columns in SCHOOLS table and their column type (datatype) and length.

In [94]:
# type in your query to retrieve all column names in the SCHOOLS table along with their datatypes and length
%sql select column_name, data_type, CHARACTER_MAXIMUM_LENGTH from information_schema.columns where upper(table_name)='CHICAGOPUBLICSCHOOLS'

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[('School_ID', 'int', None),
 ('NAME_OF_SCHOOL', 'nvarchar', 100),
 ('Elementary_Middle_or_High_School', 'nvarchar', 50),
 ('Street_Address', 'nvarchar', 50),
 ('City', 'nvarchar', 50),
 ('State', 'nvarchar', 50),
 ('ZIP_Code', 'int', None),
 ('Phone_Number', 'nvarchar', 50),
 ('Link', 'nvarchar', 100),
 ('Network_Manager', 'nvarchar', 50),
 ('Collaborative_Name', 'nvarchar', 50),
 ('Adequate_Yearly_Progress_Made', 'bit', None),
 ('Track_Schedule', 'nvarchar', 50),
 ('CPS_Performance_Policy_Status', 'nvarchar', 50),
 ('CPS_Performance_Policy_Level', 'nvarchar', 50),
 ('HEALTHY_SCHOOL_CERTIFIED', 'bit', None),
 ('Safety_Icon', 'nvarchar', 50),
 ('SAFETY_SCORE', 'tinyint', None),
 ('Family_Involvement_Icon', 'nvarchar', 50),
 ('Family_Involvement_Score', 'tinyint', None),
 ('Environment_Icon', 'nvarchar', 50),
 ('Environment_Score', 'tinyint', None),
 ('Instruction_Icon', 'nvarchar', 50),
 ('Instruction_Score', 'tinyint', None),
 ('Leaders_Icon', 'nvarchar', 50),
 ('Leaders_Score', 'tinyint', None),
 ('Teachers_Icon', 'nvarchar', 50),
 ('Teachers_Score', 'tinyint', None),
 ('Parent_Engagement_Icon', 'nvarchar', 50),
 ('Parent_Engagement_Score', 'tinyint', None),
 ('Parent_Environment_Icon', 'nvarchar', 50),
 ('Parent_Environment_Score', 'tinyint', None),
 ('AVERAGE_STUDENT_ATTENDANCE', 'nvarchar', 50),
 ('Rate_of_Misconducts_per_100_students', 'float', None),
 ('Average_Teacher_Attendance', 'nvarchar', 50),
 ('Individualized_Education_Program_Compliance_Rate', 'nvarchar', 50),
 ('Pk_2_Literacy', 'float', None),
 ('Pk_2_Math', 'float', None),
 ('Gr3_5_Grade_Level_Math', 'float', None),
 ('Gr3_5_Grade_Level_Read', 'float', None),
 ('Gr3_5_Keep_Pace_Read', 'float', None),
 ('Gr3_5_Keep_Pace_Math', 'float', None),
 ('Gr6_8_Grade_Level_Math', 'float', None),
 ('Gr6_8_Grade_Level_Read', 'float', None),
 ('Gr6_8_Keep_Pace_Math', 'float', None),
 ('Gr6_8_Keep_Pace_Read', 'float', None),
 ('Gr_8_Explore_Math', 'float', None),
 ('Gr_8_Explore_Read', 'float', None),
 ('ISAT_Exceeding_Math', 'float', None),
 ('ISAT_Exceeding_Reading', 'float', None),
 ('ISAT_Value_Add_Math', 'float', None),
 ('ISAT_Value_Add_Read', 'float', None),
 ('ISAT_Value_Add_Color_Math', 'nvarchar', 50),
 ('ISAT_Value_Add_Color_Read', 'nvarchar', 50),
 ('Students_Taking_Algebra', 'nvarchar', 50),
 ('Students_Passing_Algebra', 'nvarchar', 50),
 ('_9th_Grade_EXPLORE_2009', 'nvarchar', 50),
 ('_9th_Grade_EXPLORE_2010', 'nvarchar', 50),
 ('_10th_Grade_PLAN_2009', 'nvarchar', 50),
 ('_10th_Grade_PLAN_2010', 'nvarchar', 50),
 ('Net_Change_EXPLORE_and_PLAN', 'nvarchar', 50),
 ('_11th_Grade_Average_ACT_2011', 'nvarchar', 50),
 ('Net_Change_PLAN_and_ACT', 'nvarchar', 50),
 ('College_Eligibility', 'nvarchar', 50),
 ('Graduation_Rate', 'nvarchar', 50),
 ('College_Enrollment_Rate', 'nvarchar', 50),
 ('COLLEGE_ENROLLMENT', 'smallint', None),
 ('General_Services_Route', 'tinyint', None),
 ('Freshman_on_Track_Rate', 'nvarchar', 50),
 ('X_COORDINATE', 'float', None),
 ('Y_COORDINATE', 'float', None),
 ('Latitude', 'float', None),
 ('Longitude', 'float', None),
 ('COMMUNITY_AREA_NUMBER', 'tinyint', None),
 ('COMMUNITY_AREA_NAME', 'nvarchar', 50),
 ('Ward', 'tinyint', None),
 ('Police_District', 'tinyint', None),
 ('Location', 'nvarchar', 50)]

Double-click **here** for the solution.

<!-- Solution:

%sql select COLNAME, TYPENAME, LENGTH from SYSCAT.COLUMNS where TABNAME = 'SCHOOLS'

or

%sql select distinct(NAME), COLTYPE, LENGTH from SYSIBM.SYSCOLUMNS where TBNAME = 'SCHOOLS'

-->

### Questions

1.  Is the column name for the "SCHOOL ID" attribute in upper or mixed case?
2.  What is the name of "Community Area Name" column in your table? Does it have spaces?
3.  Are there any columns in whose names the spaces and paranthesis (round brackets) have been replaced by the underscore character "\_"?

## Problems

### Problem 1

##### How many Elementary Schools are in the dataset?

In [33]:
%sql Select count(distinct(school_id)) from chicagopublicschools where Elementary_Middle_or_High_School='ES'

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(462,)]

Double-click **here** for a hint

<!--
Which column specifies the school type e.g. 'ES', 'MS', 'HS'? ("Elementary School, Middle School, High School")
-->

Double-click **here** for another hint

<!--
Does the column name have mixed case, spaces or other special characters?
If so, ensure you use double quotes around the "Name of the Column"
-->

Double-click **here** for the solution.

<!-- Solution:

%sql select count(*) from SCHOOLS where "Elementary, Middle, or High School" = 'ES'

Correct answer: 462

-->

### Problem 2

##### What is the highest Safety Score?

In [37]:
%sql select max(safety_score) from chicagopublicschools

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(99,)]

Double-click **here** for a hint

<!--
Use the MAX() function
-->

Double-click **here** for the solution.

<!-- Hint:

%sql select MAX(Safety_Score) AS MAX_SAFETY_SCORE from SCHOOLS

Correct answer: 99
-->

### Problem 3

##### Which schools have highest Safety Score?

In [39]:
%sql select school_id, name_of_school from chicagopublicschools where safety_score=99

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(609744, 'Northside Learning Center High School'),
 (609749, 'Northside College Preparatory High School'),
 (609799, 'Alexander Graham Bell Elementary School'),
 (609803, 'James G Blaine Elementary School'),
 (609820, 'Augustus H Burley Elementary School'),
 (609880, 'Stephen Decatur Classical Elementary School'),
 (609901, 'Edgebrook Elementary School'),
 (610033, 'LaSalle Elementary Language Academy'),
 (610038, 'Abraham Lincoln Elementary School'),
 (610066, 'James E McDade Elementary Classical School'),
 (610073, 'Ellen Mitchell Elementary School'),
 (610084, 'Annie Keller Elementary Gifted Magnet School'),
 (610099, 'Norwood Park Elementary School'),
 (610105, 'Oriole Park Elementary School'),
 (610132, 'Edgar Allan Poe Elementary Classical School'),
 (610155, 'Sauganash Elementary School'),
 (610230, 'Wildwood Elementary School'),
 (610249, 'Talman Elementary School'),
 (610355, 'Mary E Courtenay Elementary Language Arts Center')]

Double-click **here** for the solution.

<!-- Solution:
In the previous problem we found out that the highest Safety Score is 99, so we can use that as an input in the where clause:

%sql select Name_of_School, Safety_Score from SCHOOLS where Safety_Score = 99

or, a better way:

%sql select Name_of_School, Safety_Score from SCHOOLS where \
  Safety_Score= (select MAX(Safety_Score) from SCHOOLS)


Correct answer: several schools with with Safety Score of 99.
-->

### Problem 4

##### What are the top 10 schools with the highest "Average Student Attendance"?

In [46]:
%sql select TOP 10 school_id, name_of_school, AVERAGE_STUDENT_ATTENDANCE from chicagopublicschools order by AVERAGE_STUDENT_ATTENDANCE DESC

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(609959, 'John Charles Haines Elementary School', '98.40%'),
 (610217, 'James Ward Elementary School', '97.80%'),
 (609842, 'Rachel Carson Elementary School', '97.60%'),
 (610132, 'Edgar Allan Poe Elementary Classical School', '97.60%'),
 (610329, 'Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 (610084, 'Annie Keller Elementary Gifted Magnet School', '97.50%'),
 (610060, 'Andrew Jackson Elementary Language Academy', '97.40%'),
 (610298, 'Lenart Elementary Regional Gifted Center', '97.40%'),
 (610515, 'Disney II Magnet School', '97.30%'),
 (610207, 'John H Vanderpoel Elementary Magnet School', '97.20%')]

Double-click **here** for the solution.

<!-- Solution:

%sql select Name_of_School, Average_Student_Attendance from SCHOOLS \
    order by Average_Student_Attendance desc nulls last limit 10 

-->

### Problem 5

##### Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [50]:
%%sql 

select top 5 school_id, name_of_school, AVERAGE_STUDENT_ATTENDANCE from chicagopublicschools 
where average_student_attendance is not null
order by AVERAGE_STUDENT_ATTENDANCE ASC

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(609702, 'Richard T Crane Technical Preparatory High School', '57.90%'),
 (609871, 'Barbara Vick Early Childhood & Family Center', '60.90%'),
 (609736, 'Dyett High School', '62.50%'),
 (609727, 'Wendell Phillips Academy High School', '63.00%'),
 (610389, 'Orr Academy High School', '66.30%')]

Double-click **here** for the solution.

<!-- Solution:

%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

-->

### Problem 6

##### Now remove the '%' sign from the above result set for Average Student Attendance column

In [52]:
%%sql 

select top 5 school_id, name_of_school, replace(AVERAGE_STUDENT_ATTENDANCE,'%','') as Percentage from chicagopublicschools 
where average_student_attendance is not null
order by AVERAGE_STUDENT_ATTENDANCE ASC

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(609702, 'Richard T Crane Technical Preparatory High School', '57.90'),
 (609871, 'Barbara Vick Early Childhood & Family Center', '60.90'),
 (609736, 'Dyett High School', '62.50'),
 (609727, 'Wendell Phillips Academy High School', '63.00'),
 (610389, 'Orr Academy High School', '66.30')]

Double-click **here** for a hint

<!--
Use the REPLACE() function to replace '%' with ''
See documentation for this function at:
https://www.ibm.com/support/knowledgecenter/en/SSEPGG_10.5.0/com.ibm.db2.luw.sql.ref.doc/doc/r0000843.html
-->

Double-click **here** for the solution.

<!-- Hint:

%sql SELECT Name_of_School, REPLACE(Average_Student_Attendance, '%', '') \
     from SCHOOLS \
     order by Average_Student_Attendance \
     fetch first 5 rows only

-->

### Problem 7

##### Which Schools have Average Student Attendance lower than 70%?

In [58]:
%%sql 

select school_id, name_of_school, average_student_attendance as Percentage from chicagopublicschools 
where average_student_attendance is not null
and cast(replace(AVERAGE_STUDENT_ATTENDANCE,'%','') as float)<70.0
order by percentage desc

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(609759, 'Roberto Clemente Community Academy High School', '69.60%'),
 (609674, 'Chicago Vocational Career Academy High School', '68.80%'),
 (609722, 'Manley Career Academy High School', '66.80%'),
 (610389, 'Orr Academy High School', '66.30%'),
 (609727, 'Wendell Phillips Academy High School', '63.00%'),
 (609736, 'Dyett High School', '62.50%'),
 (609871, 'Barbara Vick Early Childhood & Family Center', '60.90%'),
 (609702, 'Richard T Crane Technical Preparatory High School', '57.90%')]

Double-click **here** for a hint

<!--
The datatype of the "Average_Student_Attendance" column is varchar.
So you cannot use it as is in the where clause for a numeric comparison.
First use the CAST() function to cast it as a DECIMAL or DOUBLE
e.g. CAST("Column_Name" as DOUBLE)
or simply: DECIMAL("Column_Name")
-->

Double-click **here** for another hint

<!--
Don't forget the '%' age sign needs to be removed before casting
-->

Double-click **here** for the solution.

<!-- Solution:

%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     where CAST ( REPLACE(Average_Student_Attendance, '%', '') AS DOUBLE ) < 70 \
     order by Average_Student_Attendance
     
or,

%sql SELECT Name_of_School, Average_Student_Attendance  \
     from SCHOOLS \
     where DECIMAL ( REPLACE(Average_Student_Attendance, '%', '') ) < 70 \
     order by Average_Student_Attendance

-->

### Problem 8

##### Get the total College Enrollment for each Community Area

In [66]:
%%sql

select sum(COLLEGE_ENROLLMENT), COMMUNITY_AREA_NUMBER from chicagopublicschools group by COMMUNITY_AREA_NUMBER

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(4068, 1),
 (8197, 2),
 (4388, 3),
 (4132, 4),
 (7541, 5),
 (7055, 6),
 (5615, 7),
 (3362, 8),
 (910, 9),
 (6469, 10),
 (1755, 11),
 (1431, 12),
 (4210, 13),
 (6864, 14),
 (6954, 15),
 (7764, 16),
 (4568, 17),
 (1317, 18),
 (14386, 19),
 (3975, 20),
 (3640, 21),
 (7351, 22),
 (8620, 23),
 (9429, 24),
 (10933, 25),
 (2622, 26),
 (5337, 27),
 (7975, 28),
 (5146, 29),
 (14793, 30),
 (7257, 31),
 (871, 32),
 (1378, 33),
 (1458, 34),
 (4670, 35),
 (140, 36),
 (531, 37),
 (2809, 38),
 (4287, 39),
 (2648, 40),
 (1930, 41),
 (4206, 42),
 (4543, 43),
 (5042, 44),
 (1522, 45),
 (4043, 46),
 (549, 47),
 (1568, 48),
 (7020, 49),
 (1620, 50),
 (1859, 51),
 (5305, 52),
 (3240, 53),
 (1547, 54),
 (963, 55),
 (4552, 56),
 (4823, 57),
 (9647, 58),
 (1552, 59),
 (3167, 60),
 (7922, 61),
 (3700, 62),
 (9915, 63),
 (2085, 64),
 (4207, 65),
 (7086, 66),
 (5946, 67),
 (6832, 68),
 (4051, 69),
 (6483, 70),
 (4175, 71),
 (1636, 72),
 (4006, 73),
 (2091, 74),
 (3271, 75),
 (786, 76),
 (4600, 77)]

Double-click **here** for a hint

<!--
Verify the exact name of the Enrollment column in the database
Use the SUM() function to add up the Enrollments for each Community Area
-->

Double-click **here** for another hint

<!--
Don't forget to group by the Community Area
-->

Double-click **here** for the solution.

<!-- Solution:

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name 

-->

### Problem 9

##### Get the 5 Community Areas with the least total College Enrollment  sorted in ascending order

In [72]:
%%sql

select TOP 5 COMMUNITY_AREA_NUMBER, sum(COLLEGE_ENROLLMENT) as ENROLLMENT from chicagopublicschools group by COMMUNITY_AREA_NUMBER
ORDER BY ENROLLMENT

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(36, 140), (37, 531), (47, 549), (76, 786), (32, 871)]

Double-click **here** for a hint

<!--
Order the previous query and limit the number of rows you fetch
-->

Double-click **here** for the solution.

<!-- Solution:

%sql select Community_Area_Name, sum(College_Enrollment) AS TOTAL_ENROLLMENT \
   from SCHOOLS \
   group by Community_Area_Name \
   order by TOTAL_ENROLLMENT asc \
   fetch first 5 rows only

-->

### Problem 10

##### List 5 schools with lowest safety score.

In [77]:
%%sql

SELECT TOP 5 SCHOOL_ID, NAME_OF_SCHOOL, SAFETY_SCORE FROM CHICAGOPUBLICSCHOOLS
WHERE SAFETY_SCORE IS NOT NULL
ORDER BY SAFETY_SCORE

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(609819, 'Edmond Burke Elementary School', 1),
 (610108, "Luke O'Toole Elementary School", 5),
 (610202, 'George W Tilton Elementary School', 6),
 (609927, 'Foster Park Elementary School', 11),
 (609712, 'Emil G Hirsch Metropolitan High School', 13)]

Double-click **here** for the solution.

<!-- Solution:

%sql SELECT name_of_school, safety_score \
FROM schools \
ORDER BY safety_score \
LIMIT 5
-->

### Problem 11

##### Get the hardship index for the community area which has College Enrollment of 4368

In [119]:
%%sql

select se.ca, se.community_area_name from chicagosocioeconomicdata as se, 
                  (select sum(COLLEGE_ENROLLMENT) as total, COMMUNITY_AREA_NUMBER from chicagopublicschools group by community_area_number) as t
where t.total=4568
and se.ca=t.COMMUNITY_AREA_NUMBER

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(17, 'Dunning')]

Double-click **here** for the solution.

<!-- Solution:
NOTE: For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table 
      as created in the last lab of Week 3 should already exist

%%sql 
select hardship_index 
   from chicago_socioeconomic_data CD, schools CPS 
   where CD.ca = CPS.community_area_number 
      and college_enrollment = 4368

-->

### Problem 12

##### Get the hardship index for the community area which has the school with the  highest enrollment.

In [124]:
%%sql

select se.hardship_index from chicagosocioeconomicdata as se,
                              chicagopublicschools as ps
where se.ca=ps.community_area_number
and ps.college_enrollment=(select max(college_enrollment) from chicagopublicschools)

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(6,)]

In [131]:
%%sql 
select ca, community_area_name, hardship_index from chicagosocioeconomicdata 
where ca in ( select top 1 community_area_number from chicagopublicschools order by college_enrollment desc )

 * mssql+pyodbc://sa:***@sqlsodbc
Done.

[(5, 'North Center', 6)]

Double-click **here** for the solution.

<!-- Solution:
NOTE: For this solution to work the CHICAGO_SOCIOECONOMIC_DATA table 
      as created in the last lab of Week 3 should already exist

%sql select ca, community_area_name, hardship_index from chicago_socioeconomic_data \
   where ca in \
   ( select community_area_number from schools order by college_enrollment desc limit 1 )

-->

## Summary

##### In this lab you learned how to work with a real word dataset using SQL and Python. You learned how to query columns with spaces or special characters in their names and with mixed case names. You also used built in database functions and practiced how to sort, limit, and order result sets, as well as used sub-queries and worked with multiple tables.

## Author

<a href="https://www.linkedin.com/in/ravahuja/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01" target="_blank">Rav Ahuja</a>

## Change Log

| Date (YYYY-MM-DD) | Version | Changed By        | Change Description                        |
| ----------------- | ------- | ----------------- | ----------------------------------------- |
| 2021-07-09        | 2.4     | Malika            | Updated connection string                 |
| 2021-05-19        | 2.3     | Lakshmi Holla     | Updated question                          |
| 2021-04-20        | 2.2     | Malika            | Added the libraries                       |
| 2020-11-27        | 2.1     | Sannareddy Ramesh | Modified data sets and added new problems |
| 2020-08-28        | 2.0     | Lavanya           | Moved lab to course repo in GitLab        |

<hr>

## <h3 align="center"> © IBM Corporation 2020. All rights reserved. <h3/>